# Missing values

In [1]:
import pandas as pd

In [2]:
df=pd.read_csv("tem_hum.csv")

In [3]:
df

        city  Temperature_c  Humidity
0  Hyderabad           28.0       NaN
1  Hyderabad            NaN      62.0
2  Hyderabad           30.0      58.0
3   Banglore           31.0      55.0
4  Hyderabad           32.0       NaN
5  Hyderabad            NaN      59.0
6   Banglore           34.0      54.0

In [4]:
df.isnull()

    city  Temperature_c  Humidity
0  False          False      True
1  False           True     False
2  False          False     False
3  False          False     False
4  False          False      True
5  False           True     False
6  False          False     False

In [5]:
df.isnull().sum()

city             0
Temperature_c    2
Humidity         2
dtype: int64

In [6]:
df_clean=df.dropna()
df_clean

        city  Temperature_c  Humidity
2  Hyderabad           30.0      58.0
3   Banglore           31.0      55.0
6   Banglore           34.0      54.0

In [7]:
df

        city  Temperature_c  Humidity
0  Hyderabad           28.0       NaN
1  Hyderabad            NaN      62.0
2  Hyderabad           30.0      58.0
3   Banglore           31.0      55.0
4  Hyderabad           32.0       NaN
5  Hyderabad            NaN      59.0
6   Banglore           34.0      54.0

In [9]:
df["Temperature_c"]=df["Temperature_c"].fillna(df.Temperature_c.mean())
df

        city  Temperature_c  Humidity
0  Hyderabad           28.0       NaN
1  Hyderabad           31.0      62.0
2  Hyderabad           30.0      58.0
3   Banglore           31.0      55.0
4  Hyderabad           32.0       NaN
5  Hyderabad           31.0      59.0
6   Banglore           34.0      54.0

In [11]:
df["Humidity"]=df["Humidity"].fillna(df.Humidity.mean())
df

        city  Temperature_c  Humidity
0  Hyderabad           28.0      57.6
1  Hyderabad           31.0      62.0
2  Hyderabad           30.0      58.0
3   Banglore           31.0      55.0
4  Hyderabad           32.0      57.6
5  Hyderabad           31.0      59.0
6   Banglore           34.0      54.0